MikroElektronika/core_packages/PIC/XC8/def/PIC18LF13K50/mcu.h
extern volatile REFCON1bits_t REFCON1bits __at(0xFBB);
// bitfield macros
#define _REFCON1_D1NSS_POSN                                 0x0
#define _REFCON1_D1NSS_POSITION                             0x0
#define _REFCON1_D1NSS_SIZE                                 0x1
#define _REFCON1_D1NSS_LENGTH                               0x1
#define _REFCON1_D1NSS_MASK                                 0x1
#define _REFCON1_D1PSS_POSN                                 0x2
#define _REFCON1_D1PSS_POSITION                             0x2
#define _REFCON1_D1PSS_SIZE                                 0x2
#define _REFCON1_D1PSS_LENGTH                               0x2
#define _REFCON1_D1PSS_MASK                                 0xC
#define _REFCON1_DAC1OE_POSN                                0x5
#define _REFCON1_DAC1OE_POSITION                            0x5
#define _REFCON1_DAC1OE_SIZE                                0x1
#define _REFCON1_DAC1OE_LENGTH                              0x1
#define _REFCON1_DAC1OE_MASK                                0x20
#define _REFCON1_D1LPS_POSN                                 0x6
#define _REFCON1_D1LPS_POSITION                             0x6
#define _REFCON1_D1LPS_SIZE                                 0x1
#define _REFCON1_D1LPS_LENGTH                               0x1
#define _REFCON1_D1LPS_MASK                                 0x40
#define _REFCON1_D1EN_POSN                                  0x7
#define _REFCON1_D1EN_POSITION                              0x7
#define _REFCON1_D1EN_SIZE                                  0x1
#define _REFCON1_D1EN_LENGTH                                0x1
#define _REFCON1_D1EN_MASK                                  0x80
#define _REFCON1_D1PSS0_POSN                                0x2
#define _REFCON1_D1PSS0_POSITION                            0x2
#define _REFCON1_D1PSS0_SIZE                                0x1
#define _REFCON1_D1PSS0_LENGTH                              0x1
#define _REFCON1_D1PSS0_MASK                                0x4
#define _REFCON1_D1PSS1_POSN                                0x3
#define _REFCON1_D1PSS1_POSITION                            0x3
#define _REFCON1_D1PSS1_SIZE                                0x1
#define _REFCON1_D1PSS1_LENGTH                              0x1
#define _REFCON1_D1PSS1_MASK                                0x8
#define _REFCON1_D1NSS0_POSN                                0x0
#define _REFCON1_D1NSS0_POSITION                            0x0
#define _REFCON1_D1NSS0_SIZE                                0x1
#define _REFCON1_D1NSS0_LENGTH                              0x1
#define _REFCON1_D1NSS0_MASK                                0x1
// alias bitfield definitions
typedef union {
    struct {
        unsigned D1NSS                  :1;
        unsigned                        :1;
        unsigned D1PSS                  :2;
        unsigned                        :1;
        unsigned DAC1OE                 :1;
        unsigned D1LPS                  :1;
        unsigned D1EN                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned D1PSS0                 :1;
        unsigned D1PSS1                 :1;
    };
    struct {
        unsigned D1NSS0                 :1;
    };
} VREFCON1bits_t;
extern volatile VREFCON1bits_t VREFCON1bits __at(0xFBB);
// bitfield macros
#define _VREFCON1_D1NSS_POSN                                0x0
#define _VREFCON1_D1NSS_POSITION                            0x0
#define _VREFCON1_D1NSS_SIZE                                0x1
#define _VREFCON1_D1NSS_LENGTH                              0x1
#define _VREFCON1_D1NSS_MASK                                0x1
#define _VREFCON1_D1PSS_POSN                                0x2
#define _VREFCON1_D1PSS_POSITION                            0x2
#define _VREFCON1_D1PSS_SIZE                                0x2
#define _VREFCON1_D1PSS_LENGTH                              0x2
#define _VREFCON1_D1PSS_MASK                                0xC
#define _VREFCON1_DAC1OE_POSN                               0x5
#define _VREFCON1_DAC1OE_POSITION                           0x5
#define _VREFCON1_DAC1OE_SIZE                               0x1
#define _VREFCON1_DAC1OE_LENGTH                             0x1
#define _VREFCON1_DAC1OE_MASK                               0x20
#define _VREFCON1_D1LPS_POSN                                0x6
#define _VREFCON1_D1LPS_POSITION                            0x6
#define _VREFCON1_D1LPS_SIZE                                0x1
#define _VREFCON1_D1LPS_LENGTH                              0x1
#define _VREFCON1_D1LPS_MASK                                0x40
#define _VREFCON1_D1EN_POSN                                 0x7
#define _VREFCON1_D1EN_POSITION                             0x7
#define _VREFCON1_D1EN_SIZE                                 0x1
#define _VREFCON1_D1EN_LENGTH                               0x1
#define _VREFCON1_D1EN_MASK                                 0x80
#define _VREFCON1_D1PSS0_POSN                               0x2
#define _VREFCON1_D1PSS0_POSITION                           0x2
#define _VREFCON1_D1PSS0_SIZE                               0x1
#define _VREFCON1_D1PSS0_LENGTH                             0x1
#define _VREFCON1_D1PSS0_MASK                               0x4
#define _VREFCON1_D1PSS1_POSN                               0x3
#define _VREFCON1_D1PSS1_POSITION                           0x3
#define _VREFCON1_D1PSS1_SIZE                               0x1
#define _VREFCON1_D1PSS1_LENGTH                             0x1
#define _VREFCON1_D1PSS1_MASK                               0x8
#define _VREFCON1_D1NSS0_POSN                               0x0
#define _VREFCON1_D1NSS0_POSITION                           0x0
#define _VREFCON1_D1NSS0_SIZE                               0x1
#define _VREFCON1_D1NSS0_LENGTH                             0x1
#define _VREFCON1_D1NSS0_MASK                               0x1

// Register: REFCON2
#define REFCON2 REFCON2
extern volatile unsigned char           REFCON2             __at(0xFBC);
#ifndef _LIB_BUILD
asm("REFCON2 equ 0FBCh");
#endif
// aliases
extern volatile unsigned char           VREFCON2            __at(0xFBC);
#ifndef _LIB_BUILD
asm("VREFCON2 equ 0FBCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1R                  :5;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
    };
} REFCON2bits_t;
extern volatile REFCON2bits_t REFCON2bits __at(0xFBC);
// bitfield macros
#define _REFCON2_DAC1R_POSN                                 0x0
#define _REFCON2_DAC1R_POSITION                             0x0
#define _REFCON2_DAC1R_SIZE                                 0x5
#define _REFCON2_DAC1R_LENGTH                               0x5
#define _REFCON2_DAC1R_MASK                                 0x1F
#define _REFCON2_DAC1R0_POSN                                0x0
#define _REFCON2_DAC1R0_POSITION                            0x0
#define _REFCON2_DAC1R0_SIZE                                0x1
#define _REFCON2_DAC1R0_LENGTH                              0x1
#define _REFCON2_DAC1R0_MASK                                0x1
#define _REFCON2_DAC1R1_POSN                                0x1
#define _REFCON2_DAC1R1_POSITION                            0x1
#define _REFCON2_DAC1R1_SIZE                                0x1
#define _REFCON2_DAC1R1_LENGTH                              0x1
#define _REFCON2_DAC1R1_MASK                                0x2
#define _REFCON2_DAC1R2_POSN                                0x2
#define _REFCON2_DAC1R2_POSITION                            0x2
#define _REFCON2_DAC1R2_SIZE                                0x1
#define _REFCON2_DAC1R2_LENGTH                              0x1
#define _REFCON2_DAC1R2_MASK                                0x4
#define _REFCON2_DAC1R3_POSN                                0x3
#define _REFCON2_DAC1R3_POSITION                            0x3
#define _REFCON2_DAC1R3_SIZE                                0x1
#define _REFCON2_DAC1R3_LENGTH                              0x1
#define _REFCON2_DAC1R3_MASK                                0x8
#define _REFCON2_DAC1R4_POSN                                0x4
#define _REFCON2_DAC1R4_POSITION                            0x4
#define _REFCON2_DAC1R4_SIZE                                0x1
#define _REFCON2_DAC1R4_LENGTH                              0x1
#define _REFCON2_DAC1R4_MASK                                0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned DAC1R                  :5;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
    };
} VREFCON2bits_t;
extern volatile VREFCON2bits_t VREFCON2bits __at(0xFBC);
// bitfield macros
#define _VREFCON2_DAC1R_POSN                                0x0
#define _VREFCON2_DAC1R_POSITION                            0x0
#define _VREFCON2_DAC1R_SIZE                                0x5
#define _VREFCON2_DAC1R_LENGTH                              0x5
#define _VREFCON2_DAC1R_MASK                                0x1F
#define _VREFCON2_DAC1R0_POSN                               0x0
#define _VREFCON2_DAC1R0_POSITION                           0x0
#define _VREFCON2_DAC1R0_SIZE                               0x1
#define _VREFCON2_DAC1R0_LENGTH                             0x1
#define _VREFCON2_DAC1R0_MASK                               0x1
#define _VREFCON2_DAC1R1_POSN                               0x1
#define _VREFCON2_DAC1R1_POSITION                           0x1
#define _VREFCON2_DAC1R1_SIZE                               0x1
#define _VREFCON2_DAC1R1_LENGTH                             0x1
#define _VREFCON2_DAC1R1_MASK                               0x2
#define _VREFCON2_DAC1R2_POSN                               0x2
#define _VREFCON2_DAC1R2_POSITION                           0x2
#define _VREFCON2_DAC1R2_SIZE                               0x1
#define _VREFCON2_DAC1R2_LENGTH                             0x1
#define _VREFCON2_DAC1R2_MASK                               0x4
#define _VREFCON2_DAC1R3_POSN                               0x3
#define _VREFCON2_DAC1R3_POSITION                           0x3
#define _VREFCON2_DAC1R3_SIZE                               0x1
#define _VREFCON2_DAC1R3_LENGTH                             0x1
#define _VREFCON2_DAC1R3_MASK                               0x8
#define _VREFCON2_DAC1R4_POSN                               0x4
#define _VREFCON2_DAC1R4_POSITION                           0x4
#define _VREFCON2_DAC1R4_SIZE                               0x1
#define _VREFCON2_DAC1R4_LENGTH                             0x1
#define _VREFCON2_DAC1R4_MASK                               0x10

// Register: CCP1CON
#define CCP1CON CCP1CON
extern volatile unsigned char           CCP1CON             __at(0xFBD);
#ifndef _LIB_BUILD
asm("CCP1CON equ 0FBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1M                  :4;
        unsigned DC1B                   :2;
        unsigned P1M                    :2;
    };
    struct {
        unsigned CCP1M0                 :1;
        unsigned CCP1M1                 :1;
        unsigned CCP1M2                 :1;
        unsigned CCP1M3                 :1;
        unsigned DC1B0                  :1;
        unsigned DC1B1                  :1;
        unsigned P1M0                   :1;
        unsigned P1M1                   :1;
    };
} CCP1CONbits_t;
extern volatile CCP1CONbits_t CCP1CONbits __at(0xFBD);
// bitfield macros
#define _CCP1CON_CCP1M_POSN                                 0x0
#define _CCP1CON_CCP1M_POSITION                             0x0
#define _CCP1CON_CCP1M_SIZE                                 0x4
#define _CCP1CON_CCP1M_LENGTH                               0x4
#define _CCP1CON_CCP1M_MASK                                 0xF
#define _CCP1CON_DC1B_POSN                                  0x4
#define _CCP1CON_DC1B_POSITION                              0x4
#define _CCP1CON_DC1B_SIZE                                  0x2
#define _CCP1CON_DC1B_LENGTH                                0x2
#define _CCP1CON_DC1B_MASK                                  0x30
#define _CCP1CON_P1M_POSN                                   0x6
#define _CCP1CON_P1M_POSITION                               0x6
#define _CCP1CON_P1M_SIZE                                   0x2
#define _CCP1CON_P1M_LENGTH                                 0x2
#define _CCP1CON_P1M_MASK                                   0xC0
#define _CCP1CON_CCP1M0_POSN                                0x0
#define _CCP1CON_CCP1M0_POSITION                            0x0
#define _CCP1CON_CCP1M0_SIZE                                0x1
#define _CCP1CON_CCP1M0_LENGTH                              0x1
#define _CCP1CON_CCP1M0_MASK                                0x1
#define _CCP1CON_CCP1M1_POSN                                0x1
#define _CCP1CON_CCP1M1_POSITION                            0x1
#define _CCP1CON_CCP1M1_SIZE                                0x1
#define _CCP1CON_CCP1M1_LENGTH                              0x1
#define _CCP1CON_CCP1M1_MASK                                0x2
#define _CCP1CON_CCP1M2_POSN                                0x2
#define _CCP1CON_CCP1M2_POSITION                            0x2
#define _CCP1CON_CCP1M2_SIZE                                0x1
#define _CCP1CON_CCP1M2_LENGTH                              0x1
#define _CCP1CON_CCP1M2_MASK                                0x4
#define _CCP1CON_CCP1M3_POSN                                0x3
#define _CCP1CON_CCP1M3_POSITION                            0x3
#define _CCP1CON_CCP1M3_SIZE                                0x1
#define _CCP1CON_CCP1M3_LENGTH                              0x1
#define _CCP1CON_CCP1M3_MASK                                0x8
#define _CCP1CON_DC1B0_POSN                                 0x4
#define _CCP1CON_DC1B0_POSITION                             0x4
#define _CCP1CON_DC1B0_SIZE                                 0x1
#define _CCP1CON_DC1B0_LENGTH                               0x1
#define _CCP1CON_DC1B0_MASK                                 0x10
#define _CCP1CON_DC1B1_POSN                                 0x5
#define _CCP1CON_DC1B1_POSITION                             0x5
#define _CCP1CON_DC1B1_SIZE                                 0x1
#define _CCP1CON_DC1B1_LENGTH                               0x1
#define _CCP1CON_DC1B1_MASK                                 0x20
#define _CCP1CON_P1M0_POSN                                  0x6
#define _CCP1CON_P1M0_POSITION                              0x6
#define _CCP1CON_P1M0_SIZE                                  0x1
#define _CCP1CON_P1M0_LENGTH                                0x1
#define _CCP1CON_P1M0_MASK                                  0x40
#define _CCP1CON_P1M1_POSN                                  0x7
#define _CCP1CON_P1M1_POSITION                              0x7
#define _CCP1CON_P1M1_SIZE                                  0x1
#define _CCP1CON_P1M1_LENGTH                                0x1
#define _CCP1CON_P1M1_MASK                                  0x80

// Register: CCPR1
#define CCPR1 CCPR1
extern volatile unsigned short          CCPR1               __at(0xFBE);
#ifndef _LIB_BUILD
asm("CCPR1 equ 0FBEh");
#endif

// Register: CCPR1L
#define CCPR1L CCPR1L
extern volatile unsigned char           CCPR1L              __at(0xFBE);
#ifndef _LIB_BUILD
asm("CCPR1L equ 0FBEh");
#endif

// Register: CCPR1H
#define CCPR1H CCPR1H
extern volatile unsigned char           CCPR1H              __at(0xFBF);
#ifndef _LIB_BUILD
asm("CCPR1H equ 0FBFh");
#endif

// Register: ADCON2
#define ADCON2 ADCON2
extern volatile unsigned char           ADCON2              __at(0xFC0);
#ifndef _LIB_BUILD
asm("ADCON2 equ 0FC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCS                   :3;
        unsigned ACQT                   :3;
        unsigned                        :1;
        unsigned ADFM                   :1;
    };
    struct {
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
        unsigned ACQT0                  :1;
        unsigned ACQT1                  :1;
        unsigned ACQT2                  :1;
    };
} ADCON2bits_t;
